src/cf/Documents/ШтрафыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ШтрафыСотрудников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Штрафы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаШ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаШ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныШтрафов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаШ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/Штрафы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Штрафы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныШтрафов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ШтрафыСотрудников/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		// регистр Штрафы 
		Движение = Движения.Штрафы.Добавить();
		Движение.Период = ТекСтрокаСотрудники.ДатаШ;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Сумма = ТекСтрокаСотрудники.СуммаШ;
		Движение.Причина = ТекСтрокаСотрудники.ПричинаШ;
		Движение.Магазин = Магазин;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЕстьОШ=0;
	Отказ=Ложь;
	Если Магазин = Справочники.Склады.ПустаяСсылка() Тогда
		Предупреждение ("Необходимо указать принадлежность к магазину");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Сотрудники.Количество()=0 Тогда
		Сообщить ("Документ не заполнен!");
		Отказ = Истина;
		возврат;
	КонецЕсли;
	Для Каждого ТекСтр из Сотрудники Цикл
		Если Формат(ТекСтр.ДатаШ,"ДФ=ММММ") <> Месяц Тогда
			Если ТекСтр.НомерСтроки = Сотрудники.Количество() Тогда
				Предупреждение ("Месяц штрафа должен соответствовать указанному в документе месяцу!");
			КонецЕсли;
			Сообщить ("Ошибка в строке "+ТекСтр.НомерСтроки);
			ЕстьОШ = 1;
		КонецЕсли;
		Если (ТекСтр.ПричинаШ=Справочники.ПричиныШтрафов.ПустаяСсылка()) ИЛИ (ТекСтр.СуммаШ=0) ИЛИ (ТекСтр.Сотрудник=Справочники.Пользователи.ПустаяСсылка()) Тогда
			Сообщить ("В строке "+ТекСтр.НомерСтроки+" не все поля заполнены");
			ЕстьОШ=1;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОШ=1 Тогда
		Отказ=Истина;
	КонецЕсли;
			
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Сообщить ("Данный документ нельзя копировать!");
	
КонецПроцедуры
